#coding=utf-8

global dictionary
dictionary = {
'price': ['价格', '钱', '便宜', '廉价', '实惠', '划算', '少', '贵', '多', '销价', '扳价', '市价', '高', '低', '价钱', '性价比', '价', '价格比', '差价',
 			'价廉', '特价', '价比高', '降价', '物美价廉', '半价', '价位', '买价', '货真价实', '原价', '标价', '购价', '价廉物美', '涨价', '比价', '售价',
			'价高', '价格低', '低价', '优惠价', '总价', '牌价', '减价', '价低', '平价', '水价', '货价', '净价', '价差', '正价', '常价', '要价', '质优价廉',
			'优价', '天价', '最低价', '提价', '实价', '等价', '开价', '时价', '还价', '底价', '促销价', '白菜价','菜价', '保价', '起价', '出价', '成交价',
			'调价', '销售价', '溢价', '付价', '虚价', '高价位', '价格战', '价额', '加价', '零售价', '超值价', '特价品', '会员价', '卖价', '折价', '惊爆价',
			'跳楼价','性价比'],
'fakeconcern':['正品','假货', '真', '假', '一样', '不一样', '虚假', '假的', '怀疑', '骗', '骗人', '不是正品', '真品', '实体店', '真', '大品牌', '信赖', '真伪', '牌子', '品牌', "诚信"],
'promotion':["礼品", "满减", "预购", "红包", "双12", "双11", "凑单", "减", "满", "折扣", '囤货', '抢','送','促销', '赠品', '优惠', '活动', '纪念活动', '双十一', '双十二', '打折', '降价', '低价', '附加品', '赠送品', '抽奖'],
'service':["退货", "退款", "责任", "催", "不回", "联系", "卖家", "回复", "沟通", "敷衍", "效率", "电话", "应付", "理睬", "不理", "搪塞", "店家", "客服", '态度', '服务', '售后'],
'leakage':['泄露','渗漏', '漏', '漏出', '漏出来', '外漏', '不漏', '防漏', '无渗漏', '破漏', '漏光', '漏油', '无泄漏', '漏气', '漏水', '漏泄', '漏电', '地漏', '漏出去',
			'掉', '不掉', '漏掉', '小洞', '大洞','溢出'],
'package':['包装','好','差', '包裹', '粗糙', '外包装', '开包', '包装盒', '打包', '小包', '小包装', '包装箱', '包装袋', '内包装', '产品包装', '包装用', '塑料包装', '封包', '纸包',
 			'包装纸', '大包装', '纸盒包装', '纸箱包装', '包严', '包膜', '软包装', '包装法', '包装费', '包装物', '包装工', '纸包装', '真空包装', '包装材料', '包袋', '完整包',
			'包装厂', '包装业', '裹得', '裹好', '缠裹', '裹住', '稀巴烂'],
'loyalty': ["回购", '下次','一直', '再来', '一直用', '长期', '再来', '再一次', '以后', '今后', '从此以后', '连续', '多次', '很多次', '不再', '不要', '信任', '不会再来', '没有下次',
 			'花钱买教训', '再也不', '买教训', '长教训', '永远', '到死都不', '死都不会', '好多年', '很久', '继续', '再也不见'],
'smell': ['气味', '好闻', '难闻', '恶心', '香', '臭', '香味', '臭味', '香香', '香香的', '清香', '香气', '花香', '留香', '香精', '香型', '芳香', '香味儿', '香水',
			'清香味', '香味扑鼻', '香气扑鼻', '香甜', '果香', '香喷喷', '油香', '浓香', '香皂', '香水味', '香浓', '幽香', '口香', '荷香', '甜香', '余香', '够香',
			'发香味', '色香', '熏香', '香香甜甜', '飘香', '木香', '檀香', '香粉', '体香', '漂香', '菊花香', '馨香', '玉兰香', '芬香', '桂花香', '臭味儿', '臭烘烘',
			'狐臭', '狐臭味', '臭死', '发臭', '恶臭', '不好闻', '不香', '不臭', '很香', '很臭', '不很香', '不很臭', '臭气熏天', '榴莲', '屎', '鼻子', '嗅觉', '刺鼻',
			'扑鼻而来', '冲鼻', '呛鼻'],
'effect':['效果','好用', '好', '不好', '还好', '挺好用', '好好', '好看', '好使', '好玩', '好闻', '好漂亮', '好吃', '好好吃', '好美味', '音效好', '舒服', '持久', '经用',
			'保暖', '顺心', '给力', 'nice', 'good', 'fantastic', '好写', '实用', '坚固', '坚硬', '精美', '便携', '方便', '易读', '易懂', '难吃', '难闻', '难看', '丑',
			'糟心', '很淡', '很浓', '很深', '很浅', '太短', '太长', '太薄', '太粗', '太细', '太厚', '太耗电', '太慢', '太快', '太大', '太小', '太宽', '太窄', '轻巧',
			'笨重','难用','太干','干燥','头发打结','柔顺','头皮'],
'logistics':['物流', '快', '慢', '到', '时间', '顺丰', 'EMS', '百世汇通', '中通', '申通', '圆通', '韵达', '国通', '宅急送', '电话', '快递', '发货', '配送', '客服', '多久'],
}

if __name__ == '__main__':
    with open('dictionary.data', 'w', encoding='utf-8') as f:
        f.write(str(dic))
