#coding=utf-8

global dictionary
dictionary = {
'price': ['经济', '核算', '价格', '钱', '便宜', '实惠', '优惠', '贵', '划算', '高', '低', '多', '少', '太贵', '昂贵', '真贵', '性价比', '廉价', '物超所值', '价廉物美', '值', '超值'],
	
'fakeconcern':['正品', '假货', '真', '假', '一样', '不一样', '虚假', '假的', '怀疑', '骗', '骗人', '不是正品', '真品', '实体店', '真', '大品牌', '信赖', '真伪', '牌子', '品牌', "诚信"],

'promotion':["礼品", "满减", "预购", "红包", "双12", "双11", "凑单", "减", "满", "折扣", '囤货', '抢','送','促销', '赠品', '优惠', '活动', '纪念活动', '双十一', '双十二', '打折', '降价', '低价', '附加品', '赠送品', '抽奖'],

'service':["退货", "退款", "责任", "催", "不回", "联系", "卖家", "回复", "沟通", "敷衍", "效率", "电话", "应付", "理睬", "不理", "搪塞", "店家", "客服", '态度', '服务', '售后'],

'leakage':['泄露', '漏', '掉', '不掉', '溢出', '盖', '松', '紧', '洒', '严密', '撒', '渗'],
# no 漏发

'package':['包装', '好', '差', '包裹', '粗糙', '精美', '打包', '包严', '裹得', '裹好', '裹住', '盒子', '箱子', '袋', '破', '密封', '牢固'],

'loyalty': ["回购", '下次', '一直', '再来', '一直用', '长期', '以后', '连续', '多次', '不再买', '信任', '再也不', '教训', '好多年', '很久', '继续', '年年'],

'smell': ['气味', '味道', '好闻', '难闻', '香', '臭', '清香', '香气', '花香', '香精', '香型', '鼻'],

'effect':['效果', '作用', '质量', '好用', '管用', '好', '不好', '舒服', '给力', '方便', '香', '臭', '太干', '干燥', '打结', '柔顺', '头皮', '发质', '屑', '脱发', '滑', '润', '干净', '伤害', '持久', '油', '留香', '痒'],

'logistics':['物流', '快', '慢', '到', '时间', '顺丰', 'EMS', '百世汇通', '中通', '申通', '圆通', '韵达', '国通', '宅急送', '电话', '快递', '发货', '配送', '客服', '多久'],
}

if __name__ == '__main__':
    with open('dictionary.data', 'w', encoding='utf-8') as f:
        f.write(str(dic))
